app/views/notes/_fields.html.slim

SELECT "students".* FROM "students"
SELECT "courses".* FROM "courses"
SELECT "subjects".* FROM "subjects"
---
	.col.s4
		= f.input :student, :collection => Student.all
		= f.input :course, :collection => Course.all
		= f.input :subject, :collection => Subject.all