app/views/notes/index.html.slim

          td
            = Student.find(n.student_id).name if n.student_id
          td
            = Course.find(n.course_id).name if n.course_id
          td
            = Subject.find(n.subject_id).name if n.subject_id
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]