app/views/notes/show.html.slim

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  tr
    td = Student.find(@note.student_id).name
    td = Course.find(@note.course_id).name
    td = Subject.find(@note.subject_id).name