app/views/students/_fields.html.slim

SELECT "courses".* FROM "courses" WHERE "courses"."student_id" = ?  [["student_id", 1]]
---
		= f.input :name, :label => 'Nombre'
		= f.association :courses, collection: Course.all, :input_html => { :multiple => false }