app/controllers/api/v1/students_controller.rb

      def index

        @allS = []
        @students =  Student.all
        @students.each do |s|

          subj = []
          notes = Note.where(:student_id => s.id).to_a
          s.courses.each do |c|
            subj.push(c.subjects.to_a)
          end
          obj = {"student" => s, "Courses" => s.courses.to_a, "Sunjects" => subj, "Notes" => notes}
---
SELECT "students".* FROM "students"
SELECT "notes".* FROM "notes" WHERE "notes"."student_id" = ?  [["student_id", 1]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ?  [["id", 1]]
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = ?  [["id", 1]]