app/views/courses/_fields.html.slim

		= f.input :name, :label => 'Nombre'
		= f.association :subjects, :collection => Subject.all, :input_html => { :multiple => false }
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."course_id" = ?  [["course_id", 1]]