app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
---
  def index
    @course =  Course.all

INSERT INTO "courses" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "101"], ["created_at", "2018-01-11 16:20:59.112121"], ["updated_at", "2018-01-11 16:20:59.112121"]]
---
  def create
    @course =  Course.new(course_params)
    respond_to do |format|
      if @course.save

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    @course = Course.find(params[:id])