app/controllers/notes_controller.rb

  def create

    @student = Student.find(params[:note][:student])
    @course = Course.find(params[:note][:course])
    @subject = Subject.find(params[:note][:subject])
    @value = params[:note][:value]
    @note =  Note.new

    if validate_note(@value) == true
      @note.student = @student
      @note.course = @course
      @note.subject = @subject
      @note.value = @value

      respond_to do |format|
        if @note.save
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "courses".* FROM "courses"
SELECT "students".* FROM "students"
SELECT "subjects".* FROM "subjects"
INSERT INTO "notes" ("created_at", "updated_at", "value", "student_id", "subject_id", "course_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2018-01-12 02:04:54.684855"], ["updated_at", "2018-01-12 02:04:54.684855"], ["value", 20], ["student_id", 1], ["subject_id", 2], ["course_id", 1]]