app/controllers/students_controller.rb

  def create
    @student =  Student.new(student_params)
    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Maria"], ["created_at", "2018-01-11 16:13:12.919496"], ["updated_at", "2018-01-11 16:13:12.919496"]]

  def update
    @student = Student.find(params[:id])
    respond_to do |format|
      if @student.update_attributes(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["name", "Pepito"], ["updated_at", "2018-01-11 17:17:23.568731"], ["id", 2]]