app/controllers/subjects_controller.rb

  def create
    @subject =  Subject.new(subject_params)
    respond_to do |format|
      if @subject.save
---
INSERT INTO "subjects" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Matematica"], ["created_at", "2018-01-11 16:28:41.294472"], ["updated_at", "2018-01-11 16:28:41.294472"]]